; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v7 ?v5)
             (pred_1 ?v10 ?v3)
             (pred_10 ?v7 ?v3)
             (pred_3 ?v8 ?v7 )
	     (pred_11 ?v7)
             (pred_9 ?v12)
             (pred_2 ?v10)
             (pred_4 ?v3)
             (pred_5 ?v7)
             (pred_6 ?v10)
             (pred_8 ?v7)
             (pred_12 ))



(:action op_5
:parameters (?v9 ?v2 ?v11 ?v1)
:precondition (and (pred_9 ?v9) (pred_9 ?v2) (pred_2 ?v11) (pred_4 ?v1)
          (pred_7 ?v9 ?v2) (pred_1 ?v11 ?v1)
                   (pred_10 ?v2 ?v1) (pred_11 ?v9) 
                   (pred_5 ?v2) (pred_6 ?v11))
:effect (and  (pred_8 ?v2) (not (pred_5 ?v2))))


(:action op_2
:parameters (?v9 ?v6)
:precondition (and (pred_9 ?v9) (pred_9 ?v6)
               (pred_11 ?v9) (pred_7 ?v9 ?v6) (pred_8 ?v6))
:effect (and (pred_11 ?v6) (not (pred_11 ?v9))))

(:action op_3
:parameters (?v9 ?v11)
:precondition (and (pred_9 ?v9) (pred_2 ?v11) 
                  (pred_11 ?v9) (pred_3 ?v11 ?v9) (pred_12 ))
:effect (and (pred_6 ?v11)
   (not (pred_3 ?v11 ?v9)) (not (pred_12 ))))


(:action op_1
:parameters (?v9 ?v4 ?v13)
:precondition (and (pred_9 ?v9) (pred_2 ?v4) (pred_2 ?v13)
                  (pred_11 ?v9) (pred_6 ?v13) (pred_3 ?v4 ?v9))
:effect (and (pred_6 ?v4) (pred_3 ?v13 ?v9)
        (not (pred_6 ?v13)) (not (pred_3 ?v4 ?v9))))

(:action op_4
:parameters (?v9 ?v11)
:precondition (and (pred_9 ?v9) (pred_2 ?v11) 
                  (pred_11 ?v9) (pred_6 ?v11))
:effect (and (pred_12 ) (pred_3 ?v11 ?v9) (not (pred_6 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_28 obj_13 obj_20 obj_15 obj_24 obj_21 obj_25 obj_31 obj_03 obj_17 obj_22 obj_14 obj_16 obj_30 obj_01 obj_08 obj_12 obj_02 obj_07 obj_10 obj_23 obj_18 obj_11 obj_19 obj_27
    obj_04 obj_29 obj_06
    obj_26 obj_05 obj_09
    )

    (:init
       (pred_12)

       (pred_9 obj_28)
       (pred_9 obj_13)
       (pred_9 obj_20)
       (pred_9 obj_15)
       (pred_9 obj_24)
       (pred_9 obj_21)
       (pred_9 obj_25)
       (pred_9 obj_31)
       (pred_9 obj_03)
       (pred_9 obj_17)
       (pred_9 obj_22)
       (pred_9 obj_14)
       (pred_9 obj_16)
       (pred_9 obj_30)
       (pred_9 obj_01)
       (pred_9 obj_08)
       (pred_9 obj_12)
       (pred_9 obj_02)
       (pred_9 obj_07)
       (pred_9 obj_10)
       (pred_9 obj_23)
       (pred_9 obj_18)
       (pred_9 obj_11)
       (pred_9 obj_19)
       (pred_9 obj_27)
       (pred_4 obj_04)
       (pred_4 obj_29)
       (pred_4 obj_06)
       (pred_2 obj_26)
       (pred_2 obj_05)
       (pred_2 obj_09)

       (pred_7 obj_28 obj_21)
       (pred_7 obj_28 obj_13)
       (pred_7 obj_13 obj_25)
       (pred_7 obj_13 obj_20)
       (pred_7 obj_13 obj_28)
       (pred_7 obj_20 obj_31)
       (pred_7 obj_20 obj_15)
       (pred_7 obj_20 obj_13)
       (pred_7 obj_15 obj_03)
       (pred_7 obj_15 obj_24)
       (pred_7 obj_15 obj_20)
       (pred_7 obj_24 obj_17)
       (pred_7 obj_24 obj_15)
       (pred_7 obj_21 obj_22)
       (pred_7 obj_21 obj_25)
       (pred_7 obj_21 obj_28)
       (pred_7 obj_25 obj_14)
       (pred_7 obj_25 obj_31)
       (pred_7 obj_25 obj_13)
       (pred_7 obj_25 obj_21)
       (pred_7 obj_31 obj_16)
       (pred_7 obj_31 obj_03)
       (pred_7 obj_31 obj_20)
       (pred_7 obj_31 obj_25)
       (pred_7 obj_03 obj_30)
       (pred_7 obj_03 obj_17)
       (pred_7 obj_03 obj_15)
       (pred_7 obj_03 obj_31)
       (pred_7 obj_17 obj_01)
       (pred_7 obj_17 obj_24)
       (pred_7 obj_17 obj_03)
       (pred_7 obj_22 obj_08)
       (pred_7 obj_22 obj_14)
       (pred_7 obj_22 obj_21)
       (pred_7 obj_14 obj_12)
       (pred_7 obj_14 obj_16)
       (pred_7 obj_14 obj_25)
       (pred_7 obj_14 obj_22)
       (pred_7 obj_16 obj_02)
       (pred_7 obj_16 obj_30)
       (pred_7 obj_16 obj_31)
       (pred_7 obj_16 obj_14)
       (pred_7 obj_30 obj_07)
       (pred_7 obj_30 obj_01)
       (pred_7 obj_30 obj_03)
       (pred_7 obj_30 obj_16)
       (pred_7 obj_01 obj_10)
       (pred_7 obj_01 obj_17)
       (pred_7 obj_01 obj_30)
       (pred_7 obj_08 obj_23)
       (pred_7 obj_08 obj_12)
       (pred_7 obj_08 obj_22)
       (pred_7 obj_12 obj_18)
       (pred_7 obj_12 obj_02)
       (pred_7 obj_12 obj_14)
       (pred_7 obj_12 obj_08)
       (pred_7 obj_02 obj_11)
       (pred_7 obj_02 obj_07)
       (pred_7 obj_02 obj_16)
       (pred_7 obj_02 obj_12)
       (pred_7 obj_07 obj_19)
       (pred_7 obj_07 obj_10)
       (pred_7 obj_07 obj_30)
       (pred_7 obj_07 obj_02)
       (pred_7 obj_10 obj_27)
       (pred_7 obj_10 obj_01)
       (pred_7 obj_10 obj_07)
       (pred_7 obj_23 obj_18)
       (pred_7 obj_23 obj_08)
       (pred_7 obj_18 obj_11)
       (pred_7 obj_18 obj_12)
       (pred_7 obj_18 obj_23)
       (pred_7 obj_11 obj_19)
       (pred_7 obj_11 obj_02)
       (pred_7 obj_11 obj_18)
       (pred_7 obj_19 obj_27)
       (pred_7 obj_19 obj_07)
       (pred_7 obj_19 obj_11)
       (pred_7 obj_27 obj_10)
       (pred_7 obj_27 obj_19)
       (pred_5 obj_23)
       (pred_5 obj_12)
       (pred_5 obj_07)
       (pred_10  obj_23 obj_04)
       (pred_10  obj_12 obj_29)
       (pred_10  obj_07 obj_06)
       (pred_8 obj_28)
       (pred_8 obj_13)
       (pred_8 obj_20)
       (pred_8 obj_15)
       (pred_8 obj_24)
       (pred_8 obj_21)
       (pred_8 obj_25)
       (pred_8 obj_31)
       (pred_8 obj_03)
       (pred_8 obj_17)
       (pred_8 obj_22)
       (pred_8 obj_14)
       (pred_8 obj_16)
       (pred_8 obj_30)
       (pred_8 obj_01)
       (pred_8 obj_08)
       (pred_8 obj_02)
       (pred_8 obj_10)
       (pred_8 obj_18)
       (pred_8 obj_11)
       (pred_8 obj_19)
       (pred_8 obj_27)

       (pred_1  obj_26 obj_04)
       (pred_1  obj_05 obj_29)
       (pred_1  obj_09 obj_06)
       (pred_3 obj_26 obj_19)
       (pred_3 obj_05 obj_02)
       (pred_3 obj_09 obj_18)
       (pred_11 obj_21)
    )

    (:goal (and
       (pred_3 obj_09 obj_17)
    ))
(:constraints
  (always (not (pred_11 obj_16)))
)
)

; plan
1. (op_2 obj_21 obj_25)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_25)
   goals met: 0 of 1
2. (op_2 obj_25 obj_31)
   deleted: (pred_11 obj_25)
   added: (pred_11 obj_31)
   goals met: 0 of 1
3. (op_2 obj_31 obj_03)
   deleted: (pred_11 obj_31)
   added: (pred_11 obj_03)
   goals met: 0 of 1
4. (op_2 obj_03 obj_30)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_30)
   goals met: 0 of 1
5. (op_2 obj_30 obj_01)
   deleted: (pred_11 obj_30)
   added: (pred_11 obj_01)
   goals met: 0 of 1
6. (op_2 obj_01 obj_10)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_10)
   goals met: 0 of 1
7. (op_2 obj_10 obj_27)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_27)
   goals met: 0 of 1
8. (op_2 obj_27 obj_19)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_19)
   goals met: 0 of 1
9. (op_2 obj_19 obj_11)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_11)
   goals met: 0 of 1
10. (op_2 obj_11 obj_18)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_18)
   goals met: 0 of 1
11. (op_3 obj_18 obj_09)
   deleted: (pred_3 obj_09 obj_18) (pred_12)
   added: (pred_6 obj_09)
   goals met: 0 of 1
12. (op_2 obj_18 obj_11)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_11)
   goals met: 0 of 1
13. (op_2 obj_11 obj_19)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_19)
   goals met: 0 of 1
14. (op_2 obj_19 obj_27)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_27)
   goals met: 0 of 1
15. (op_2 obj_27 obj_10)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_10)
   goals met: 0 of 1
16. (op_2 obj_10 obj_01)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_01)
   goals met: 0 of 1
17. (op_2 obj_01 obj_17)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_17)
   goals met: 0 of 1
18. (op_4 obj_17 obj_09)
   deleted: (pred_6 obj_09)
   added: (pred_12) (pred_3 obj_09 obj_17)
   goals met: 1 of 1
